In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
d = pd.Series(data=[4,8,15,16,23,42])
print(d)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
import pandas as pd 
list = [1,3,4,5,6,7,89,2,34,5]
pd.Series(list)

0     1
1     3
2     4
3     5
4     6
5     7
6    89
7     2
8    34
9     5
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [7]:
import pandas as pd 
pd.DataFrame({'Name':['Alice','Bob','Claire'],
              'Age':[25,30,27],
              'Gender':['Female','Male','Female']})

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Differences-->  A Pandas Series is a 1D array of data. A Series has to have an index defined
                DataFrame is a 2D table with one column. An index can be optional.
    Example -
    
import pandas as pd
r = pd.Series([1,23,4,5,67,8,9,11])
s = pd.Series([2,34,5,6,7,89,22,11])
pd.DataFrame({"N": r,"S":s})

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
Answer--> 1. read_csv()
          2. head()
          3. describe()
         4. memory_usage()
        5. astype()
        6. loc[:]
        7. to_datetime()
        8. value_counts()
        9. drop_duplicates()
        10. groupby()
        11. merge()
        12. sort_values()
        13. fillna()
        
        
Example -->


import pandas as pd 
ns = pd.DataFrame({'Name':['Alice','Bob','Claire'],
              'Age':[25,30,27],
              'Gender':['Female','Male','Female']})
ns.head()

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Answer--> Panel & Dataframe are mutable in nature.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:
import pandas as pd
r = pd.Series([1,23,4,5,67,8,9,11])
s = pd.Series([2,34,5,6,7,89,22,11])
pd.DataFrame({"N": r,"S":s})


Explanation--------->  Two series makes one DataFrame.

    N   S
0   1   2
1  23  34
2   4   5
3   5   6
4  67   7
5   8  89
6   9  22
7  11  11